fonecmid-diplom/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаНачалаДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ДатаОкончанияДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормамиКлиентСервер/Module.bsl
#Область ПрограммныйИнтерфейс 


// Дополняет элементы в открытую форму.
// 
// Параметры:
//  Форма - Форма - Открытая форма
Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
		
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда		
		ДобавитьПоляПериодаДействия(Форма);
		ДобавитьПолеСуммаАбонентскойПлаты(Форма);
		ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	ИначеЕсли ИмяФормы = "Документ.РеализацияТоваровУслуг.Форма.ФормаДокумента" Тогда
		ДобавитьКомандуЗаполнить(Форма);
	КонецЕсли;
	
КонецПроцедуры


// Изменяет видимость полей формы в зависимости от значения реквизитов.
// 
// Параметры:
//  Форма - Форма - Открытая форма
Процедура ИзменитьВидимостьПолейФормы(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ФормаЭлемента" Тогда
		
		ВидДоговора = Форма.Объект.ВидДоговора;
		
		Если ВидДоговора = ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
			Форма.ЭтотОбъект.Элементы.ДатаНачалаПериодаДействия.Видимость = Истина;
			Форма.ЭтотОбъект.Элементы.ДатаОкончанияПериодаДействия.Видимость = Истина;
			Форма.ЭтотОбъект.Элементы.СуммаАбонентскойПлаты.Видимость = Истина;
			Форма.ЭтотОбъект.Элементы.СтоимостьЧасаРаботы.Видимость = Истина;
		Иначе
			Форма.ЭтотОбъект.Элементы.ДатаНачалаПериодаДействия.Видимость = Ложь;
			Форма.ЭтотОбъект.Элементы.ДатаОкончанияПериодаДействия.Видимость = Ложь;
			Форма.ЭтотОбъект.Элементы.СуммаАбонентскойПлаты.Видимость = Ложь;
			Форма.ЭтотОбъект.Элементы.СтоимостьЧасаРаботы.Видимость = Ложь;	
		КонецЕсли;
		
	КонецЕсли;
		
КонецПроцедуры
 
#КонецОбласти


#Область СлужебныеПроцедурыИФункции 

Процедура ДобавитьПоляПериодаДействия(Форма);
	
	ГруппаПериодДействия = Форма.Элементы.Добавить("ГруппаПериодДействия", Тип("ГруппаФормы"));
	ГруппаПериодДействия.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействия.Отображение = ОтображениеОбычнойГруппы.Нет;
	ГруппаПериодДействия.ОтображатьЗаголовок = Ложь;
	ГруппаПериодДействия.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;
	
	ПолеВводаНачалоДействия = Форма.Элементы.Добавить("ДатаНачалаПериодаДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействия);
	ПолеВводаНачалоДействия.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаНачалоДействия.ПутьКДанным = "Объект.ВКМ_ДатаНачалаДействияДоговора";
	ПолеВводаНачалоДействия.Заголовок = "Дата начала действия";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВводаНачалоДействия.Видимость = Ложь;
	КонецЕсли;
	
	ПолеВводаОкончаниеДействия = Форма.Элементы.Добавить("ДатаОкончанияПериодаДействия", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействия);
	ПолеВводаОкончаниеДействия.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВводаОкончаниеДействия.ПутьКДанным = "Объект.ВКМ_ДатаОкончанияДействияДоговора";
	ПолеВводаОкончаниеДействия.Заголовок = "Дата окончания действия";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВводаОкончаниеДействия.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеСуммаАбонентскойПлаты(Форма);
	
	ПолеВвода = Форма.Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВвода.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	
	ПолеВвода = Форма.Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
	Если Форма.Объект.ВидДоговора <> ПредопределенноеЗначение("Перечисление.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание") Тогда
		ПолеВвода.Видимость = Ложь;
	КонецЕсли;
	
КонецПроцедуры

Процедура ДобавитьКомандуЗаполнить(Форма)
	
	КомандаЗаполнить = Форма.Команды.Добавить("Заполнить");
	КомандаЗаполнить.Действие = "Заполнить";
	КомандаЗаполнить.Заголовок = "Заполнить";
	
	КнопкаЗаполнить = Форма.Элементы.Добавить("КнопкаЗаполнить", Тип("КнопкаФормы"), Форма.КоманднаяПанель);
	КнопкаЗаполнить.ИмяКоманды = "Заполнить";
	
КонецПроцедуры


#КонецОбласти
